In [1]:
import sqlalchemy
%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 서브쿼리 사용하기 1(단일행 서브쿼리)

Ex1. 사원 테이블에서 최대월급을 받는 사원의 이름과 월급을 출력하시오
```select ename, sal
    from emp
    where sal = max(sal)``` -> 작동하지 않음
```select ename, max(sal)
    from emp ```-> 이 역시 작동하지 않음
- 위의 SQL을 수행하려면 서브쿼리문을 사용해야 함  


Ex2. JONES의 월급을 출력하시오!

In [5]:
%%sql

select ename, sal
    from emp
    where ename = 'JONES'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JONES', Decimal('2975'))]

Ex3. JONES의 월급 보다 더 많은 월급을 받는 사람들의 이름과 월급을 출력하시오

In [7]:
%%sql

select ename, sal
    from emp
    where sal > 2975

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

In [8]:
%%sql

select ename, sal
    from emp
    where sal > (select sal
                    from emp
                    where ename = 'JONES')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

- 쿼리를 두번 각각 실행하지 말고 위와 같이 한번에 수행하자!    

문제 265. SCOTT과 같은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [10]:
%%sql

select ename, sal
    from emp
    where sal = (select sal
                    from emp
                    where ename = 'SCOTT')
        and ename != 'SCOTT'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('FORD', Decimal('3000'))]

문제 266. SMITH와 직업이 같은 사원들의 이름과 직업을 출력하는데
             SMITH는 제외하고 출력하시오

In [12]:
%%sql

select ename, job
    from emp
    where job = (select job
                    from emp
                    where ename = 'SMITH')
         and ename != 'SMITH'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JAMES', 'CLERK'), ('ADAMS', 'CLERK'), ('MILLER', 'CLERK')]


문제 267. ALLEN 보다 늦게 입사한 사원들의 입사일을 출력하시오!

In [13]:
%%sql

select ename, hiredate
    from emp
    where hiredate > (select hiredate
                         from emp
                         where ename = 'ALLEN')
          and ename != 'ALLEN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', datetime.datetime(1981, 11, 17, 0, 0)),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0)),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0)),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0)),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0)),
 ('WARD', datetime.datetime(1981, 2, 23, 0, 0)),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0)),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0)),
 ('ADAMS', datetime.datetime(1983, 1, 15, 0, 0)),
 ('MILLER', datetime.datetime(1982, 1, 11, 0, 0))]

문제 268. 직업이 SALESMAN인 사원의 최대월급보다 
             더 많은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [15]:
%%sql

select ename, sal
    from emp
    where sal > (select max(sal)
                        from emp
                        where job = 'SALESMAN')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('JONES', Decimal('2975')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000'))]

문제 269. 최대 월급을 받는 사원의 이름과 월급을 출력하시오

In [16]:
%%sql

select ename, sal
    from emp
    where sal = (select max(sal)
                    from emp)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'))]

문제 270. 전공에 통계가 포함되어져 있는 학생들 중에서의 
              최대 나이인 학생의 이름과 나이와 전공을 출력하시오

In [30]:
%%sql

select substr(ename ,1,1)||'*' as name, 
       substr(age, 1, 1)||'*' as age, 
       '**'||substr(major, 4, 2)||'**' as major
    from emp12
    where major like '%통계%'
          and age = (select max(age)
                        from emp12
                        where major like '%통계%')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('송*', '2*', '**통계**')]

문제 271. KING 에게 보고하는 사원들의 이름을 출력하시오   
(KING 에게 보고하는 사원들은 KING의 직속부하 사원들입니다.)  
	      KING의 직속 부하 사원들의 MGR 번호는 KING의 EMPNO입니다.

In [33]:
%%sql

select ename
    from emp
    where mgr = ( select empno
                      from emp
                      where ename = 'KING')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE',), ('CLARK',), ('JONES',)]

# 서브 쿼리 사용하기 2(다중 행 서브쿼리)
- 서브쿼리의 종류 3가지
    1. 단일행 서브 쿼리: 서브 쿼리에서 메인 쿼리로 하나의 값이 리턴되는 경우
    - 연산자: =, <,>, <=, >=, !=, <>, ^=
    2. 다중행 서브 쿼리: 서브 쿼리에서 메인 쿼리로 여러 개의 값이 리턴되는 경우
    - 연산자: in, not, in, >all, <all, >any, <any
    3. 다중 컬럼 서브 쿼리: 서브 쿼리에서 메인 쿼리로 여러 개의 컬럼 값이 리턴되는 경우
                                   
<br>
                                               
Ex) 직업이 SALESMAN인 사원들과 월급이 같은 사원들의 이름과 월급을 출력하시오

In [37]:
%%sql

select ename, sal
    from emp
    where sal in (select sal
                    from emp
                     where job='SALESMAN')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250')),
 ('WARD', Decimal('1250')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500'))]

문제 272. 통신사가 sk인 학생들과 
             나이가 같은 학생들의 이름과 나이와 통신사를 출력하시오

In [41]:
%%sql

select replace(ename, 
               substr(ename, 
                              case when length(ename)=4 then 3 else 2 end, 1)
                                                                               ,'*') as name,
       substr(age, 1, 1)||'*' as age, 
       telecom
    from emp12
    where age in (select age
                     from emp12
                     where telecom='sk')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('현*연', '3*', 'sk'),
 ('이*혁', '2*', 'kt'),
 ('성*창', '2*', 'sk'),
 ('송*미', '2*', 'kt'),
 ('김*라', '2*', 'kt'),
 ('유*영', '2*', 'sk'),
 ('김*민', '2*', 'lg'),
 ('김*원', '2*', 'kt'),
 ('권*환', '2*', 'kt'),
 ('구*모', '2*', 'sk'),
 ('정*희', '2*', 'kt'),
 ('허*', '2*', 'kt'),
 ('양*준', '2*', 'sk'),
 ('김*순', '3*', 'sk'),
 ('허*민', '3*', 'sk'),
 ('남궁*미', '2*', 'kt'),
 ('김*승', '2*', 'lg'),
 ('김*린', '2*', 'kt'),
 ('신*종', '2*', 'lg'),
 ('이*성', '2*', 'sk'),
 ('황*현', '2*', 'kt'),
 ('정*원', '2*', 'sk'),
 ('김*비', '2*', 'kt'),
 ('권*원', '3*', 'sk')]